{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Ejercicio: Twitter Graph\n",
    "\n",
    "En este ejercicio vamos a modelar la red social de Twitter en Neo4j.\n",
    "\n",
    "* Un usuario genera tweets, por lo tanto es su autor.\n",
    "* Los tweets contienen un texto y este texto puede tener hashtags.\n",
    "* Un usuario puede mencionar a otro usuario en un tweet.\n",
    "* Un usuario puede retweetear un tweet de otro usuario en un nuevo tweet.\n",
    "\n",
    "El grafo que quermos generar es el siguiente:\n",
    "\n",
    "![png](../images/neo4j/twitter1.png)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Antes de empezar con el ejercico, vamos a importar las librerías necesarias para trabajar sobre Neo4j"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Como hacemos siempre, borramos todos los nodos y relaciones que existen en la base de datos para partir de un entorno limpio."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from pprintpp import pprint as pp\n",
    "from py2neo import Graph, Relationship, Node\n",
    "import json\n",
    "\n",
    "graph = Graph(\"http://neo4j:1234@neo4j:7474/db/data\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph.run(\"MATCH (n) DETACH DELETE n\").evaluate()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Antes de empezar a insertar nodos y relaciones, queremos crear una serie de ídices y constraints"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Ejercicio1: La propiedad id de los nodos etiquetados como Tweet debe ser único:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {
    "scrolled": true
   },
   "outputs": [],
   "source": [
    "graph.run(\"CREATE CONSTRAINT ON (tweet:Tweet) ASSERT tweet.id IS UNIQUE\").evaluate()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Borrar el CONSTRAINT\n",
    "# graph.run(\"DROP CONSTRAINT ON (tweet:Tweet) ASSERT tweet.id IS UNIQUE\").evaluate()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Ejercicio2: La propiedad username de los nodos etiquetados como User debe ser único."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph.run(\"CREATE CONSTRAINT ON (user:User) ASSERT user.username IS UNIQUE\").evaluate()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Ejercicio3: La propiedad hashtag de los nodos etiquetados como HashTag debe ser único."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph.run(\"CREATE CONSTRAINT ON (hashtag:HashTag) ASSERT hashtag.hashtag IS UNIQUE\").evaluate()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Antes de realizar las búsquedas, vamos a insertar unos cuantos datos en el grafo con la estructura que hemos definido.\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Recibe un usuario en formato JSON y crea un nodo con los datos de ese usuario.\n",
    "# Como resultado devuelve el nodo creaado.\n",
    "def parse_user(user_json):\n",
    "    \n",
    "    # Crea el nodo con la etiqueta \"User\" y le asigna el valor a la propiedad \"username\" que es única.\n",
    "    user = Node(\"User\", username = user_json['screen_name'])\n",
    "    \n",
    "    # Para el resto de propiedades del usuario, si el dato existe en el JSON la añade al nodo con el metodo update()\n",
    "    if 'created_at' in user_json:\n",
    "        user.update(created_at = user_json['created_at'])\n",
    "    if 'description' in user_json:\n",
    "        user.update(description = user_json['description'])\n",
    "    if 'favourites_count' in user_json:\n",
    "        user.update(favourites_count = user_json['favourites_count'])\n",
    "    if 'followers_count' in user_json:\n",
    "        user.update(followers_count = user_json['followers_count'])\n",
    "    if 'friends_count' in user_json:\n",
    "        user.update(friends_count = user_json['friends_count'])\n",
    "    if 'statuses_count' in user_json:\n",
    "        user.update(statuses_count = user_json['statuses_count'])\n",
    "    if 'time_zone' in user_json:\n",
    "        user.update(time_zone = user_json['time_zone'])\n",
    "    if 'name' in user_json:\n",
    "        user.update(name = user_json['name'])\n",
    "    if 'profile_image_url' in user_json:\n",
    "        user.update(profile_image_url = user_json['profile_image_url'])\n",
    "    \n",
    "    try:\n",
    "        # Crea el nodo en neo4j\n",
    "        graph.create(user)\n",
    "    except:\n",
    "        # Si existe lanza una excepción ya que el nombre de usuario es único.\n",
    "        # Buscamos el nodo que ya existe por nombe de usuario y lo devolvemos.\n",
    "        # Utilizamos el método run que permite ejecutar cualquier sentencia.\n",
    "        user = graph.run(\"MATCH (user:User {username : '%s'}) RETURN user\" % (user_json['screen_name'])).evaluate()\n",
    "        pass\n",
    "\n",
    "    # Devolvemos el nodo creado\n",
    "    return user"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [],
   "source": [
    "#Parsea el tweet y crea tanto el Nodo Tweet, como el Nodo User que crea el tweet más los nodos User de sus menciones\n",
    "#Además crea lo nodos #HashTag con los hashtag que contiene el tweet.\n",
    "#Por último crea todas las relacciones entre los nodos creados, TWEETED, MENCIONED, HASHTAG y RETWEET_OF\n",
    "def parse_tweet(tweet_json):\n",
    "    \n",
    "    #Cogemos el campo user del json y lo pasamos al método anterior que parsea e inserta el usuario.\n",
    "    user = parse_user(tweet_json['user'])\n",
    "    \n",
    "    #Creamos el Nodo con el label Tweet que contien los datos del tweet que stamos parseando\n",
    "    tweet = Node(\"Tweet\",\n",
    "                 id = tweet_json['id'],\n",
    "                 created_at = tweet_json['created_at'],\n",
    "                 lang = tweet_json['lang'],\n",
    "                 retweet_count = tweet_json['retweet_count'],\n",
    "                 source = tweet_json['source'],\n",
    "                 text = tweet_json['text']\n",
    "                )\n",
    "    \n",
    "    try:\n",
    "        # Crea el tweet en neo4j\n",
    "        graph.create(tweet)\n",
    "    except:\n",
    "        # Si el tweet ya existe lanza una excepción, por lo que lo buscamos y lo asignamos a la variable tweet.\n",
    "        tweet = graph.run(\"MATCH (t:Tweet {id : %s}) RETURN t\" % (tweet_json['id'])).evaluate()\n",
    "        pass\n",
    "    \n",
    "    # Creamos la relacción TWEETED entre el Nodo de tipo User y el Nodo de tipo Tweet que hemos insertado\n",
    "    user_tweeted_tweet = Relationship(user, \"TWEETED\", tweet)\n",
    "    graph.create(user_tweeted_tweet)\n",
    "    \n",
    "    # Comprobamos si tiene menciones y añadimos los nodos de tipo User con los datos del usuario mencionado\n",
    "    # Creamos la relacción MENCIONED entre el tweet y el usuario mencionado.\n",
    "    if 'user_mentions' in tweet_json:\n",
    "        for user_mention_json in tweet_json['user_mentions']:\n",
    "            user_mencioned = parse_user(user_mention_json)\n",
    "            tweet_mencioned_user = Relationship(tweet, \"MENCIONED\", user_mencioned)\n",
    "            graph.create(tweet_mencioned_user)\n",
    " \n",
    "    # Comprobamos si el tweet contiene hashtags y si es así creamos los nodos de tipo HashTag y las relacciones\n",
    "    # HASHTAG ente el hashtag y el tweet que lo contiene.\n",
    "    if 'entities' in tweet_json:\n",
    "        for entity in tweet_json['entities']:\n",
    "            hashtag = Node(\"HashTag\", hashtag = entity)\n",
    "            try:\n",
    "                graph.create(hashtag)\n",
    "            except:\n",
    "                hashtag = graph.run(\"MATCH (h:HashTag {hashtag : '%s'}) RETURN h\" % (entity)).evaluate()\n",
    "                pass\n",
    "            tweet_HashTag_hashtag = Relationship(tweet, \"HASHTAG\", hashtag)\n",
    "            graph.create(tweet_HashTag_hashtag)\n",
    "\n",
    "    # Por último comprobamos si se trata de un retweet y si es así creamos la relacción RETWEET_OF entre el \n",
    "    # tweet y el usuario que lo retweetea\n",
    "    if 'retweeted_status' in tweet_json:\n",
    "        user_retweeted = parse_user(tweet_json['retweeted_status']['user'])\n",
    "        tweet_retweetOf_user = Relationship(tweet, \"RETWEET_OF\", user_retweeted)\n",
    "        graph.create(tweet_retweetOf_user)\n",
    "        \n",
    "        parse_tweet(tweet_json['retweeted_status'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Este método lee el fichero indicado por parámetro. \n",
    "# Parsea cada linea en formato JSON. Cada línea representa un tweet.\n",
    "def load_file(tweets_data_path):\n",
    "    tweets_file = open(tweets_data_path, \"r\")\n",
    "    for tweet in tweets_file:\n",
    "        parse_tweet(json.loads(tweet))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "ename": "KeyboardInterrupt",
     "evalue": "",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mTypeError\u001b[0m                                 Traceback (most recent call last)",
      "\u001b[0;32m/opt/conda/lib/python3.6/site-packages/urllib3/connectionpool.py\u001b[0m in \u001b[0;36m_make_request\u001b[0;34m(self, conn, method, url, timeout, chunked, **httplib_request_kw)\u001b[0m\n\u001b[1;32m    376\u001b[0m             \u001b[0;32mtry\u001b[0m\u001b[0;34m:\u001b[0m  \u001b[0;31m# Python 2.7, use buffering of HTTP responses\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 377\u001b[0;31m                 \u001b[0mhttplib_response\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mconn\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mgetresponse\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mbuffering\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mTrue\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    378\u001b[0m             \u001b[0;32mexcept\u001b[0m \u001b[0mTypeError\u001b[0m\u001b[0;34m:\u001b[0m  \u001b[0;31m# Python 2.6 and older, Python 3\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mTypeError\u001b[0m: getresponse() got an unexpected keyword argument 'buffering'",
      "\nDuring handling of the above exception, another exception occurred:\n",
      "\u001b[0;31mKeyboardInterrupt\u001b[0m                         Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-15-e5e760970265>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m()\u001b[0m\n\u001b[1;32m      1\u001b[0m \u001b[0;31m#Carga el fichero con los tweets.\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m----> 2\u001b[0;31m \u001b[0mload_file\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m'../data/mongoDB/tweets.json'\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m",
      "\u001b[0;32m<ipython-input-14-06f3bf9d0b54>\u001b[0m in \u001b[0;36mload_file\u001b[0;34m(tweets_data_path)\u001b[0m\n\u001b[1;32m      4\u001b[0m     \u001b[0mtweets_file\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mopen\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mtweets_data_path\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m\"r\"\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m      5\u001b[0m     \u001b[0;32mfor\u001b[0m \u001b[0mtweet\u001b[0m \u001b[0;32min\u001b[0m \u001b[0mtweets_file\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m----> 6\u001b[0;31m         \u001b[0mparse_tweet\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mjson\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mloads\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mtweet\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m",
      "\u001b[0;32m<ipython-input-13-51c012e62319>\u001b[0m in \u001b[0;36mparse_tweet\u001b[0;34m(tweet_json)\u001b[0m\n\u001b[1;32m     55\u001b[0m         \u001b[0muser_retweeted\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mparse_user\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mtweet_json\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;34m'retweeted_status'\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;34m'user'\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     56\u001b[0m         \u001b[0mtweet_retweetOf_user\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mRelationship\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mtweet\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m\"RETWEET_OF\"\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0muser_retweeted\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 57\u001b[0;31m         \u001b[0mgraph\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mcreate\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mtweet_retweetOf_user\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     58\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     59\u001b[0m         \u001b[0mparse_tweet\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mtweet_json\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;34m'retweeted_status'\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/opt/conda/lib/python3.6/site-packages/py2neo/database.py\u001b[0m in \u001b[0;36mcreate\u001b[0;34m(self, subgraph)\u001b[0m\n\u001b[1;32m    589\u001b[0m                        \u001b[0;34m:\u001b[0m\u001b[0;32mclass\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;31m`\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mSubgraph\u001b[0m\u001b[0;31m`\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    590\u001b[0m         \"\"\"\n\u001b[0;32m--> 591\u001b[0;31m         \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mupdate\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;32mlambda\u001b[0m \u001b[0mtx\u001b[0m\u001b[0;34m:\u001b[0m \u001b[0mtx\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mcreate\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0msubgraph\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    592\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    593\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mdelete\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0msubgraph\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/opt/conda/lib/python3.6/site-packages/py2neo/database.py\u001b[0m in \u001b[0;36mupdate\u001b[0;34m(self, cypher, parameters, timeout)\u001b[0m\n\u001b[1;32m    443\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0mcallable\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mcypher\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    444\u001b[0m             \u001b[0;32mif\u001b[0m \u001b[0mparameters\u001b[0m \u001b[0;32mis\u001b[0m \u001b[0;32mNone\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 445\u001b[0;31m                 \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_update\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mcypher\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mtimeout\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mtimeout\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    446\u001b[0m             elif (isinstance(parameters, tuple) and len(parameters) == 2 and\n\u001b[1;32m    447\u001b[0m                     isinstance(parameters[0], Sequence) and isinstance(parameters[1], Mapping)):\n",
      "\u001b[0;32m/opt/conda/lib/python3.6/site-packages/py2neo/database.py\u001b[0m in \u001b[0;36m_update\u001b[0;34m(self, f, timeout)\u001b[0m\n\u001b[1;32m    465\u001b[0m             \u001b[0mtx\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0;32mNone\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    466\u001b[0m             \u001b[0;32mtry\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 467\u001b[0;31m                 tx = self.begin(\n\u001b[0m\u001b[1;32m    468\u001b[0m                                 \u001b[0;31m# after=after, metadata=metadata, timeout=timeout\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    469\u001b[0m                                 )\n",
      "\u001b[0;32m/opt/conda/lib/python3.6/site-packages/py2neo/database.py\u001b[0m in \u001b[0;36mbegin\u001b[0;34m(self, readonly)\u001b[0m\n\u001b[1;32m    349\u001b[0m         \u001b[0mremoved\u001b[0m\u001b[0;34m.\u001b[0m \u001b[0mUse\u001b[0m \u001b[0mthe\u001b[0m \u001b[0;34m'auto'\u001b[0m \u001b[0mmethod\u001b[0m \u001b[0minstead\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0;34m*\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    350\u001b[0m         \"\"\"\n\u001b[0;32m--> 351\u001b[0;31m         return Transaction(self, autocommit=False, readonly=readonly,\n\u001b[0m\u001b[1;32m    352\u001b[0m                            \u001b[0;31m# after, metadata, timeout\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    353\u001b[0m                            )\n",
      "\u001b[0;32m/opt/conda/lib/python3.6/site-packages/py2neo/database.py\u001b[0m in \u001b[0;36m__init__\u001b[0;34m(self, graph, autocommit, readonly)\u001b[0m\n\u001b[1;32m    913\u001b[0m             \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_ref\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0;32mNone\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    914\u001b[0m         \u001b[0;32melse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 915\u001b[0;31m             self._ref = self._connector.begin(self.graph.name, readonly=readonly,\n\u001b[0m\u001b[1;32m    916\u001b[0m                                               \u001b[0;31m# after, metadata, timeout\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    917\u001b[0m                                               )\n",
      "\u001b[0;32m/opt/conda/lib/python3.6/site-packages/py2neo/client/__init__.py\u001b[0m in \u001b[0;36mbegin\u001b[0;34m(self, graph_name, readonly)\u001b[0m\n\u001b[1;32m   1357\u001b[0m         \u001b[0mcx\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_acquire\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mgraph_name\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1358\u001b[0m         \u001b[0;32mtry\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m-> 1359\u001b[0;31m             return cx.begin(graph_name, readonly=readonly,\n\u001b[0m\u001b[1;32m   1360\u001b[0m                             \u001b[0;31m# after=after, metadata=metadata, timeout=timeout\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1361\u001b[0m                             )\n",
      "\u001b[0;32m/opt/conda/lib/python3.6/site-packages/py2neo/client/http.py\u001b[0m in \u001b[0;36mbegin\u001b[0;34m(self, graph_name, readonly)\u001b[0m\n\u001b[1;32m    196\u001b[0m             \u001b[0;31m# if timeout:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    197\u001b[0m             \u001b[0;31m#     raise TypeError(\"Transaction timeouts are not supported over HTTP\")\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 198\u001b[0;31m             \u001b[0mr\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_post\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mHTTPTransactionRef\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mbegin_uri\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mgraph_name\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    199\u001b[0m             \u001b[0mrs\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mHTTPResponse\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mfrom_json\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mr\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mstatus\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mr\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mdata\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mdecode\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"utf-8\"\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    200\u001b[0m             \u001b[0mlocation_path\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0murlsplit\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mr\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mheaders\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;34m\"Location\"\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mpath\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/opt/conda/lib/python3.6/site-packages/py2neo/client/http.py\u001b[0m in \u001b[0;36m_post\u001b[0;34m(self, url, statement, parameters)\u001b[0m\n\u001b[1;32m    335\u001b[0m                                           \u001b[0murl\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0murl\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    336\u001b[0m                                           \u001b[0mheaders\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mdict\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mheaders\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0;34m{\u001b[0m\u001b[0;34m\"Content-Type\"\u001b[0m\u001b[0;34m:\u001b[0m \u001b[0;34m\"application/json\"\u001b[0m\u001b[0;34m}\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 337\u001b[0;31m                                           body=json_dumps({\"statements\": statements}))\n\u001b[0m\u001b[1;32m    338\u001b[0m         \u001b[0;32mexcept\u001b[0m \u001b[0mHTTPError\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0merror\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    339\u001b[0m             \u001b[0mraise_from\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mProtocolError\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"Failed to POST to %r\"\u001b[0m \u001b[0;34m%\u001b[0m \u001b[0murl\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0merror\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/opt/conda/lib/python3.6/site-packages/urllib3/request.py\u001b[0m in \u001b[0;36mrequest\u001b[0;34m(self, method, url, fields, headers, **urlopen_kw)\u001b[0m\n\u001b[1;32m     70\u001b[0m             return self.request_encode_body(method, url, fields=fields,\n\u001b[1;32m     71\u001b[0m                                             \u001b[0mheaders\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mheaders\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 72\u001b[0;31m                                             **urlopen_kw)\n\u001b[0m\u001b[1;32m     73\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     74\u001b[0m     def request_encode_url(self, method, url, fields=None, headers=None,\n",
      "\u001b[0;32m/opt/conda/lib/python3.6/site-packages/urllib3/request.py\u001b[0m in \u001b[0;36mrequest_encode_body\u001b[0;34m(self, method, url, fields, headers, encode_multipart, multipart_boundary, **urlopen_kw)\u001b[0m\n\u001b[1;32m    148\u001b[0m         \u001b[0mextra_kw\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mupdate\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0murlopen_kw\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    149\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 150\u001b[0;31m         \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0murlopen\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mmethod\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0murl\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0mextra_kw\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m",
      "\u001b[0;32m/opt/conda/lib/python3.6/site-packages/urllib3/connectionpool.py\u001b[0m in \u001b[0;36murlopen\u001b[0;34m(self, method, url, body, headers, retries, redirect, assert_same_host, timeout, pool_timeout, release_conn, chunked, body_pos, **response_kw)\u001b[0m\n\u001b[1;32m    598\u001b[0m                                                   \u001b[0mtimeout\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mtimeout_obj\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    599\u001b[0m                                                   \u001b[0mbody\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mbody\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mheaders\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mheaders\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 600\u001b[0;31m                                                   chunked=chunked)\n\u001b[0m\u001b[1;32m    601\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    602\u001b[0m             \u001b[0;31m# If we're going to release the connection in ``finally:``, then\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/opt/conda/lib/python3.6/site-packages/urllib3/connectionpool.py\u001b[0m in \u001b[0;36m_make_request\u001b[0;34m(self, conn, method, url, timeout, chunked, **httplib_request_kw)\u001b[0m\n\u001b[1;32m    378\u001b[0m             \u001b[0;32mexcept\u001b[0m \u001b[0mTypeError\u001b[0m\u001b[0;34m:\u001b[0m  \u001b[0;31m# Python 2.6 and older, Python 3\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    379\u001b[0m                 \u001b[0;32mtry\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 380\u001b[0;31m                     \u001b[0mhttplib_response\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mconn\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mgetresponse\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    381\u001b[0m                 \u001b[0;32mexcept\u001b[0m \u001b[0mException\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0me\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    382\u001b[0m                     \u001b[0;31m# Remove the TypeError from the exception chain in Python 3;\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/opt/conda/lib/python3.6/http/client.py\u001b[0m in \u001b[0;36mgetresponse\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m   1329\u001b[0m         \u001b[0;32mtry\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1330\u001b[0m             \u001b[0;32mtry\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m-> 1331\u001b[0;31m                 \u001b[0mresponse\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mbegin\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m   1332\u001b[0m             \u001b[0;32mexcept\u001b[0m \u001b[0mConnectionError\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1333\u001b[0m                 \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mclose\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/opt/conda/lib/python3.6/http/client.py\u001b[0m in \u001b[0;36mbegin\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    295\u001b[0m         \u001b[0;31m# read until we get a non-100 response\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    296\u001b[0m         \u001b[0;32mwhile\u001b[0m \u001b[0;32mTrue\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 297\u001b[0;31m             \u001b[0mversion\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mstatus\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mreason\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_read_status\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    298\u001b[0m             \u001b[0;32mif\u001b[0m \u001b[0mstatus\u001b[0m \u001b[0;34m!=\u001b[0m \u001b[0mCONTINUE\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    299\u001b[0m                 \u001b[0;32mbreak\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/opt/conda/lib/python3.6/http/client.py\u001b[0m in \u001b[0;36m_read_status\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    256\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    257\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0m_read_status\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 258\u001b[0;31m         \u001b[0mline\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mstr\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mfp\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mreadline\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0m_MAXLINE\u001b[0m \u001b[0;34m+\u001b[0m \u001b[0;36m1\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m\"iso-8859-1\"\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    259\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0mlen\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mline\u001b[0m\u001b[0;34m)\u001b[0m \u001b[0;34m>\u001b[0m \u001b[0m_MAXLINE\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    260\u001b[0m             \u001b[0;32mraise\u001b[0m \u001b[0mLineTooLong\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"status line\"\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/opt/conda/lib/python3.6/socket.py\u001b[0m in \u001b[0;36mreadinto\u001b[0;34m(self, b)\u001b[0m\n\u001b[1;32m    584\u001b[0m         \u001b[0;32mwhile\u001b[0m \u001b[0;32mTrue\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    585\u001b[0m             \u001b[0;32mtry\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 586\u001b[0;31m                 \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_sock\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mrecv_into\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mb\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    587\u001b[0m             \u001b[0;32mexcept\u001b[0m \u001b[0mtimeout\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    588\u001b[0m                 \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_timeout_occurred\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0;32mTrue\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mKeyboardInterrupt\u001b[0m: "
     ]
    }
   ],
   "source": [
    "#Carga el fichero con los tweets.\n",
    "load_file('../data/mongoDB/tweets.json')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Total de Tweets: 660\n"
     ]
    }
   ],
   "source": [
    "# Imprimir todos los tweets existentes:\n",
    "query = \"\"\"\n",
    "MATCH (tweet:Tweet)\n",
    "RETURN COUNT(tweet) AS totalTweets;\n",
    "\"\"\"\n",
    "\n",
    "result = graph.run(query)\n",
    "\n",
    "for record in result:\n",
    "    print(\"Total de Tweets:\", record[\"totalTweets\"])"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Ejercicio 4: Obten para cada usuario el total de tweets que ha generado"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>username</th><th>totalTweets</th></tr><tr><td style=\"text-align:left\">geneolot</td><td style=\"text-align:right\">48</td></tr><tr><td style=\"text-align:left\">Dev_Topics</td><td style=\"text-align:right\">47</td></tr><tr><td style=\"text-align:left\">ameanmbot</td><td style=\"text-align:right\">29</td></tr><tr><td style=\"text-align:left\">BigDataTweetBot</td><td style=\"text-align:right\">28</td></tr><tr><td style=\"text-align:left\">ClearGrip</td><td style=\"text-align:right\">28</td></tr><tr><td style=\"text-align:left\">retweetjava</td><td style=\"text-align:right\">20</td></tr><tr><td style=\"text-align:left\">vikasjee</td><td style=\"text-align:right\">17</td></tr><tr><td style=\"text-align:left\">Pvalsfr</td><td style=\"text-align:right\">11</td></tr><tr><td style=\"text-align:left\">couchbase</td><td style=\"text-align:right\">7</td></tr><tr><td style=\"text-align:left\">McMcgregory</td><td style=\"text-align:right\">7</td></tr><tr><td style=\"text-align:left\">NoSqlRR</td><td style=\"text-align:right\">7</td></tr><tr><td style=\"text-align:left\">SiliconArmada</td><td style=\"text-align:right\">7</td></tr><tr><td style=\"text-align:left\">javacodegeeks</td><td style=\"text-align:right\">5</td></tr><tr><td style=\"text-align:left\">webcodegeeks</td><td style=\"text-align:right\">5</td></tr><tr><td style=\"text-align:left\">hostgatorcodes</td><td style=\"text-align:right\">5</td></tr><tr><td style=\"text-align:left\">TodoCoders</td><td style=\"text-align:right\">5</td></tr><tr><td style=\"text-align:left\">ganeshkr2005</td><td style=\"text-align:right\">5</td></tr><tr><td style=\"text-align:left\">DamianoMe</td><td style=\"text-align:right\">4</td></tr><tr><td style=\"text-align:left\">e4eiitlab</td><td style=\"text-align:right\">4</td></tr><tr><td style=\"text-align:left\">radhikaostny</td><td style=\"text-align:right\">4</td></tr><tr><td style=\"text-align:left\">Czajkowski</td><td style=\"text-align:right\">4</td></tr><tr><td style=\"text-align:left\">analyticbridge</td><td style=\"text-align:right\">4</td></tr><tr><td style=\"text-align:left\">theinfinitus1</td><td style=\"text-align:right\">4</td></tr><tr><td style=\"text-align:left\">vgonnot</td><td style=\"text-align:right\">4</td></tr><tr><td style=\"text-align:left\">DataconomyMedia</td><td style=\"text-align:right\">3</td></tr><tr><td style=\"text-align:left\">javapsyche</td><td style=\"text-align:right\">3</td></tr><tr><td style=\"text-align:left\">WorlWindWriting</td><td style=\"text-align:right\">3</td></tr><tr><td style=\"text-align:left\">redlocal</td><td style=\"text-align:right\">3</td></tr><tr><td style=\"text-align:left\">OHughe5</td><td style=\"text-align:right\">3</td></tr><tr><td style=\"text-align:left\">cesarnogCPS</td><td style=\"text-align:right\">3</td></tr><tr><td style=\"text-align:left\">DataStaxCareers</td><td style=\"text-align:right\">3</td></tr><tr><td style=\"text-align:left\">prakash_6174</td><td style=\"text-align:right\">3</td></tr><tr><td style=\"text-align:left\">algoworks</td><td style=\"text-align:right\">3</td></tr><tr><td style=\"text-align:left\">BigdataITJobs</td><td style=\"text-align:right\">3</td></tr><tr><td style=\"text-align:left\">UpStartup</td><td style=\"text-align:right\">3</td></tr><tr><td style=\"text-align:left\">lexinerus</td><td style=\"text-align:right\">2</td></tr><tr><td style=\"text-align:left\">itknowingness</td><td style=\"text-align:right\">2</td></tr><tr><td style=\"text-align:left\">lisabriercliffe</td><td style=\"text-align:right\">2</td></tr><tr><td style=\"text-align:left\">techmustard</td><td style=\"text-align:right\">2</td></tr><tr><td style=\"text-align:left\">BestNoSQL</td><td style=\"text-align:right\">2</td></tr><tr><td style=\"text-align:left\">akmalchaudhri</td><td style=\"text-align:right\">2</td></tr><tr><td style=\"text-align:left\">NeuvooPhpCA</td><td style=\"text-align:right\">2</td></tr><tr><td style=\"text-align:left\">TechtoberAR</td><td style=\"text-align:right\">2</td></tr><tr><td style=\"text-align:left\">SILVERRUN_Tools</td><td style=\"text-align:right\">2</td></tr><tr><td style=\"text-align:left\">not_only_NoSQL</td><td style=\"text-align:right\">2</td></tr><tr><td style=\"text-align:left\">googlecloud</td><td style=\"text-align:right\">2</td></tr><tr><td style=\"text-align:left\">bibonix</td><td style=\"text-align:right\">2</td></tr><tr><td style=\"text-align:left\">jobs4devs</td><td style=\"text-align:right\">2</td></tr><tr><td style=\"text-align:left\">edmoffo</td><td style=\"text-align:right\">2</td></tr><tr><td style=\"text-align:left\">96Washimakram</td><td style=\"text-align:right\">2</td></tr><tr><td style=\"text-align:left\">DBaker007</td><td style=\"text-align:right\">2</td></tr><tr><td style=\"text-align:left\">OstCareers</td><td style=\"text-align:right\">2</td></tr><tr><td style=\"text-align:left\">bigdataconf</td><td style=\"text-align:right\">2</td></tr><tr><td style=\"text-align:left\">3rmarketn</td><td style=\"text-align:right\">2</td></tr><tr><td style=\"text-align:left\">bold_consulting</td><td style=\"text-align:right\">2</td></tr><tr><td style=\"text-align:left\">CircuitStatic</td><td style=\"text-align:right\">2</td></tr><tr><td style=\"text-align:left\">rey_atkinson</td><td style=\"text-align:right\">2</td></tr><tr><td style=\"text-align:left\">giantapp</td><td style=\"text-align:right\">2</td></tr><tr><td style=\"text-align:left\">EmmaClark_GWR</td><td style=\"text-align:right\">2</td></tr><tr><td style=\"text-align:left\">3rmarkete</td><td style=\"text-align:right\">2</td></tr><tr><td style=\"text-align:left\">aerospikedb</td><td style=\"text-align:right\">2</td></tr><tr><td style=\"text-align:left\">DukeHudsonLTD</td><td style=\"text-align:right\">2</td></tr><tr><td style=\"text-align:left\">Rodrigosqsz</td><td style=\"text-align:right\">2</td></tr><tr><td style=\"text-align:left\">matkeep</td><td style=\"text-align:right\">2</td></tr><tr><td style=\"text-align:left\">techpearce2</td><td style=\"text-align:right\">2</td></tr><tr><td style=\"text-align:left\">erlanghacker</td><td style=\"text-align:right\">2</td></tr><tr><td style=\"text-align:left\">earthfalcon33</td><td style=\"text-align:right\">2</td></tr><tr><td style=\"text-align:left\">realmanurana</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">pinaldave</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">MAGISTR_OM</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">recuweb</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">ThugMetrics</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">jppastor</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">plevy</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">shainsingh</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">DataRainmaker</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">DutGRG</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">setechec</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">xMAnton</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">tommymessbauer</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">P_O_Bourge</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">Salebarn_LLC</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">computer_ksa</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">thinklets</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">kestelyn</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">moacybarros</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">WearableAgency</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">VoidMonk</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">figuerosky</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">ICstaffing</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">prajyotpro</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">dnrz33</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">OrientDB</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">discussionsclub</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">craigbrownphd</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">AlessioCavone</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">FelixLGriffin</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">iamRVel</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">michaelyoungMBN</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">ChronicFarting</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">freitasmanuel</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">digitalcloudgal</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">pottava</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">bigboardsio</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">jlamigueiro</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">arangodb</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">JohnnyAffolter</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">bryangrimes</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">MarutiTech</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">GaggleFeed</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">NeuvooSunnyval</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">joindewalvis</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">Growth__Hacking</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">nodenow</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">ArturoTT1</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">JuJuStubs</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">hitonomichi</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">netofthethings</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">EspaceEmplois</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">sangudi</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">N1QL</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">rkeshavmurthy</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">FranckPachot</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">zkajdan</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">lqgusso</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">PSG_13</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">haskengren</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">DataModelGuru</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">ThinkJavaScript</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">SILVERRUN_RDM</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">Grandite</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">GranditeNews</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">Vnomicinfo</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">challenbeck</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">CONTENTsoVIRAL</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">pingtimeout</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">leepollington</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">MihaelaBisnel</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">rohitpath</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">FritzlerErik</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">StevenRHulse</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">VKyritsis</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">tarrask</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">SoftwareJokes</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">MurphyRichard01</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">tmj_sfo_finance</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">impsardo</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">fh_bash</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">ShirleyYYoung</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">SparxxApp</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">RaySr1946</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">tonyojeda3</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">Makolyte</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">patio11</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">beala_ebooks</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">ronenschwartz</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">N_Dimensi0ns</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">tmj_sfo_sales</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">tran_latoya</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">KirkDBorne</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">jerrymangan</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">FernandoFukuda</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">renatogaion</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">boldarray</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">developer_tv</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">arthurbarbato</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">thebuzm</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">pqatsi</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">richardanchieta</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">nraboy</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">abhayit2000</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">NeuvooITUS</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">cardilogix</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">AlphaNano</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">rainfc</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">Azure</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">thluiz</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">fabioperalves</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">OctavianoTatau</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">7wdata</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">MartinTroup</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">ikwattro</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">BestAWS</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">nyike</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">NeuvooITSea</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">KurtKraut</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">semrise</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">bindashsandeep</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">RasuShrestha</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">BigDataBorat</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">MarkLogic</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">thestonewell</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">dlinstedt</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">Advaiyasolns</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">ricofritzsche</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">Sys_Cloud</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">nutanix</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">trainingstack</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">sahvenni</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">PLarroye</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">peteaven</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">pedrofmb</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">NiaLLLarkin</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">Gobdonnakijit</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">DugasWolford</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">MaeBiggs2</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">JoyeCotter</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">bikthor</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">Ashnikbiz</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">CM_DBA</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">dbiservices</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">DavidALeigh</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">faruk_celik_</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">SantiFdezMunoz</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">SimpleMinutes</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">NeuvooEngSanta</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">carl_chenet</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">journalduhacker</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">mytuxfr</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">MindGame_by_v2k</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">ebarroca</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">nuxeo</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">LsAdvanced</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">_EdsonDionisio</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">mmoazami</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">ajmuguia</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">Loui_Picard</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">tmj_bos_eng</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">GonzaloGarde</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">CSGTrippSmith</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">PeterIturry</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">JoanIratxeta</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">tmj_was_eng</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">LJ_Blanchard</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">NeuvooITSanJose</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">Fernanrelenia</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">JavaFact</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">miroburn</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">jgarcedi</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">lambdamedia</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">InsideTECH_ASIA</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">jjlakosta</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">GorkaSainzt</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">saitou1978</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">Annemartialle</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">shiv4nsh</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">calvinwang82</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">iAnand_Mishra</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">cristhian_lopez</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">btburnett3</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">SmartDataCo</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">aneeshnair</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">ThoHeller</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">mloughlin</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">cassandra</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">BestCourses_</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">websug</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">CliffHCohen</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">patrickdiez</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">SY_HCL</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">agonyou</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">thomas_quinlan</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">jaynvora</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">MarioLifePool</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">serdaroncode</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">Get_it_Now_Sale</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">Woody_MS_Bloke</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">NeuvooWatford</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">mpisching</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">AlessandroNegro</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">Samhanknr</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">NenadBozicNs</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">SmartCat_io</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">b4d_tR1p</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">albertspijkers</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">Datalaker</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">triggsley</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">irregularbi</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">Klehmann79</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">3rmarketf</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">Andrey_Lomakin</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">solyarisoftware</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">SA_infra</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">3rmarketfv</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">javioreto</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">Mario_Ezquerro</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">JohnnySoftware</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">kidehen</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">remialvado</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">TheMarketingU</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">GrowthBible</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">NtshFlors409</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">nimkar</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">jamesddube</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">HansB001</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">JamesJosephIgoe</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">SylvainRoussy</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">NeuvooITSunnyv</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">NeuvooRouen</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">Nubexx</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">NirajMrunal</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">smqueue_live</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">harsha549</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">GruberHaig</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">VillagomezGetz</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">MendenhallParke</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">LaytonBowles</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">AustinTamsyn1</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">OgdenRoselyn</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">FischerMaya</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">VamsiMeher</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">cloudboostio</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">LoopAILabs</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">patboshuizen</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">JLWoodward</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">javijunquera</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">mr_delkh</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">saeedurity</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">kphaser</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">smokin_wes</td><td style=\"text-align:right\">1</td></tr><tr><td style=\"text-align:left\">yodathekiller</td><td style=\"text-align:right\">1</td></tr></table>"
      ],
      "text/plain": [
       " username        | totalTweets \n",
       "-----------------|-------------\n",
       " geneolot        |          48 \n",
       " Dev_Topics      |          47 \n",
       " ameanmbot       |          29 \n",
       " BigDataTweetBot |          28 \n",
       " ClearGrip       |          28 \n",
       " retweetjava     |          20 \n",
       " vikasjee        |          17 \n",
       " Pvalsfr         |          11 \n",
       " couchbase       |           7 \n",
       " McMcgregory     |           7 \n",
       " NoSqlRR         |           7 \n",
       " SiliconArmada   |           7 \n",
       " javacodegeeks   |           5 \n",
       " webcodegeeks    |           5 \n",
       " hostgatorcodes  |           5 \n",
       " TodoCoders      |           5 \n",
       " ganeshkr2005    |           5 \n",
       " DamianoMe       |           4 \n",
       " e4eiitlab       |           4 \n",
       " radhikaostny    |           4 \n",
       " Czajkowski      |           4 \n",
       " analyticbridge  |           4 \n",
       " theinfinitus1   |           4 \n",
       " vgonnot         |           4 \n",
       " DataconomyMedia |           3 \n",
       " javapsyche      |           3 \n",
       " WorlWindWriting |           3 \n",
       " redlocal        |           3 \n",
       " OHughe5         |           3 \n",
       " cesarnogCPS     |           3 \n",
       " DataStaxCareers |           3 \n",
       " prakash_6174    |           3 \n",
       " algoworks       |           3 \n",
       " BigdataITJobs   |           3 \n",
       " UpStartup       |           3 \n",
       " lexinerus       |           2 \n",
       " itknowingness   |           2 \n",
       " lisabriercliffe |           2 \n",
       " techmustard     |           2 \n",
       " BestNoSQL       |           2 \n",
       " akmalchaudhri   |           2 \n",
       " NeuvooPhpCA     |           2 \n",
       " TechtoberAR     |           2 \n",
       " SILVERRUN_Tools |           2 \n",
       " not_only_NoSQL  |           2 \n",
       " googlecloud     |           2 \n",
       " bibonix         |           2 \n",
       " jobs4devs       |           2 \n",
       " edmoffo         |           2 \n",
       " 96Washimakram   |           2 \n",
       " DBaker007       |           2 \n",
       " OstCareers      |           2 \n",
       " bigdataconf     |           2 \n",
       " 3rmarketn       |           2 \n",
       " bold_consulting |           2 \n",
       " CircuitStatic   |           2 \n",
       " rey_atkinson    |           2 \n",
       " giantapp        |           2 \n",
       " EmmaClark_GWR   |           2 \n",
       " 3rmarkete       |           2 \n",
       " aerospikedb     |           2 \n",
       " DukeHudsonLTD   |           2 \n",
       " Rodrigosqsz     |           2 \n",
       " matkeep         |           2 \n",
       " techpearce2     |           2 \n",
       " erlanghacker    |           2 \n",
       " earthfalcon33   |           2 \n",
       " realmanurana    |           1 \n",
       " pinaldave       |           1 \n",
       " MAGISTR_OM      |           1 \n",
       " recuweb         |           1 \n",
       " ThugMetrics     |           1 \n",
       " jppastor        |           1 \n",
       " plevy           |           1 \n",
       " shainsingh      |           1 \n",
       " DataRainmaker   |           1 \n",
       " DutGRG          |           1 \n",
       " setechec        |           1 \n",
       " xMAnton         |           1 \n",
       " tommymessbauer  |           1 \n",
       " P_O_Bourge      |           1 \n",
       " Salebarn_LLC    |           1 \n",
       " computer_ksa    |           1 \n",
       " thinklets       |           1 \n",
       " kestelyn        |           1 \n",
       " moacybarros     |           1 \n",
       " WearableAgency  |           1 \n",
       " VoidMonk        |           1 \n",
       " figuerosky      |           1 \n",
       " ICstaffing      |           1 \n",
       " prajyotpro      |           1 \n",
       " dnrz33          |           1 \n",
       " OrientDB        |           1 \n",
       " discussionsclub |           1 \n",
       " craigbrownphd   |           1 \n",
       " AlessioCavone   |           1 \n",
       " FelixLGriffin   |           1 \n",
       " iamRVel         |           1 \n",
       " michaelyoungMBN |           1 \n",
       " ChronicFarting  |           1 \n",
       " freitasmanuel   |           1 \n",
       " digitalcloudgal |           1 \n",
       " pottava         |           1 \n",
       " bigboardsio     |           1 \n",
       " jlamigueiro     |           1 \n",
       " arangodb        |           1 \n",
       " JohnnyAffolter  |           1 \n",
       " bryangrimes     |           1 \n",
       " MarutiTech      |           1 \n",
       " GaggleFeed      |           1 \n",
       " NeuvooSunnyval  |           1 \n",
       " joindewalvis    |           1 \n",
       " Growth__Hacking |           1 \n",
       " nodenow         |           1 \n",
       " ArturoTT1       |           1 \n",
       " JuJuStubs       |           1 \n",
       " hitonomichi     |           1 \n",
       " netofthethings  |           1 \n",
       " EspaceEmplois   |           1 \n",
       " sangudi         |           1 \n",
       " N1QL            |           1 \n",
       " rkeshavmurthy   |           1 \n",
       " FranckPachot    |           1 \n",
       " zkajdan         |           1 \n",
       " lqgusso         |           1 \n",
       " PSG_13          |           1 \n",
       " haskengren      |           1 \n",
       " DataModelGuru   |           1 \n",
       " ThinkJavaScript |           1 \n",
       " SILVERRUN_RDM   |           1 \n",
       " Grandite        |           1 \n",
       " GranditeNews    |           1 \n",
       " Vnomicinfo      |           1 \n",
       " challenbeck     |           1 \n",
       " CONTENTsoVIRAL  |           1 \n",
       " pingtimeout     |           1 \n",
       " leepollington   |           1 \n",
       " MihaelaBisnel   |           1 \n",
       " rohitpath       |           1 \n",
       " FritzlerErik    |           1 \n",
       " StevenRHulse    |           1 \n",
       " VKyritsis       |           1 \n",
       " tarrask         |           1 \n",
       " SoftwareJokes   |           1 \n",
       " MurphyRichard01 |           1 \n",
       " tmj_sfo_finance |           1 \n",
       " impsardo        |           1 \n",
       " fh_bash         |           1 \n",
       " ShirleyYYoung   |           1 \n",
       " SparxxApp       |           1 \n",
       " RaySr1946       |           1 \n",
       " tonyojeda3      |           1 \n",
       " Makolyte        |           1 \n",
       " patio11         |           1 \n",
       " beala_ebooks    |           1 \n",
       " ronenschwartz   |           1 \n",
       " N_Dimensi0ns    |           1 \n",
       " tmj_sfo_sales   |           1 \n",
       " tran_latoya     |           1 \n",
       " KirkDBorne      |           1 \n",
       " jerrymangan     |           1 \n",
       " FernandoFukuda  |           1 \n",
       " renatogaion     |           1 \n",
       " boldarray       |           1 \n",
       " developer_tv    |           1 \n",
       " arthurbarbato   |           1 \n",
       " thebuzm         |           1 \n",
       " pqatsi          |           1 \n",
       " richardanchieta |           1 \n",
       " nraboy          |           1 \n",
       " abhayit2000     |           1 \n",
       " NeuvooITUS      |           1 \n",
       " cardilogix      |           1 \n",
       " AlphaNano       |           1 \n",
       " rainfc          |           1 \n",
       " Azure           |           1 \n",
       " thluiz          |           1 \n",
       " fabioperalves   |           1 \n",
       " OctavianoTatau  |           1 \n",
       " 7wdata          |           1 \n",
       " MartinTroup     |           1 \n",
       " ikwattro        |           1 \n",
       " BestAWS         |           1 \n",
       " nyike           |           1 \n",
       " NeuvooITSea     |           1 \n",
       " KurtKraut       |           1 \n",
       " semrise         |           1 \n",
       " bindashsandeep  |           1 \n",
       " RasuShrestha    |           1 \n",
       " BigDataBorat    |           1 \n",
       " MarkLogic       |           1 \n",
       " thestonewell    |           1 \n",
       " dlinstedt       |           1 \n",
       " Advaiyasolns    |           1 \n",
       " ricofritzsche   |           1 \n",
       " Sys_Cloud       |           1 \n",
       " nutanix         |           1 \n",
       " trainingstack   |           1 \n",
       " sahvenni        |           1 \n",
       " PLarroye        |           1 \n",
       " peteaven        |           1 \n",
       " pedrofmb        |           1 \n",
       " NiaLLLarkin     |           1 \n",
       " Gobdonnakijit   |           1 \n",
       " DugasWolford    |           1 \n",
       " MaeBiggs2       |           1 \n",
       " JoyeCotter      |           1 \n",
       " bikthor         |           1 \n",
       " Ashnikbiz       |           1 \n",
       " CM_DBA          |           1 \n",
       " dbiservices     |           1 \n",
       " DavidALeigh     |           1 \n",
       " faruk_celik_    |           1 \n",
       " SantiFdezMunoz  |           1 \n",
       " SimpleMinutes   |           1 \n",
       " NeuvooEngSanta  |           1 \n",
       " carl_chenet     |           1 \n",
       " journalduhacker |           1 \n",
       " mytuxfr         |           1 \n",
       " MindGame_by_v2k |           1 \n",
       " ebarroca        |           1 \n",
       " nuxeo           |           1 \n",
       " LsAdvanced      |           1 \n",
       " _EdsonDionisio  |           1 \n",
       " mmoazami        |           1 \n",
       " ajmuguia        |           1 \n",
       " Loui_Picard     |           1 \n",
       " tmj_bos_eng     |           1 \n",
       " GonzaloGarde    |           1 \n",
       " CSGTrippSmith   |           1 \n",
       " PeterIturry     |           1 \n",
       " JoanIratxeta    |           1 \n",
       " tmj_was_eng     |           1 \n",
       " LJ_Blanchard    |           1 \n",
       " NeuvooITSanJose |           1 \n",
       " Fernanrelenia   |           1 \n",
       " JavaFact        |           1 \n",
       " miroburn        |           1 \n",
       " jgarcedi        |           1 \n",
       " lambdamedia     |           1 \n",
       " InsideTECH_ASIA |           1 \n",
       " jjlakosta       |           1 \n",
       " GorkaSainzt     |           1 \n",
       " saitou1978      |           1 \n",
       " Annemartialle   |           1 \n",
       " shiv4nsh        |           1 \n",
       " calvinwang82    |           1 \n",
       " iAnand_Mishra   |           1 \n",
       " cristhian_lopez |           1 \n",
       " btburnett3      |           1 \n",
       " SmartDataCo     |           1 \n",
       " aneeshnair      |           1 \n",
       " ThoHeller       |           1 \n",
       " mloughlin       |           1 \n",
       " cassandra       |           1 \n",
       " BestCourses_    |           1 \n",
       " websug          |           1 \n",
       " CliffHCohen     |           1 \n",
       " patrickdiez     |           1 \n",
       " SY_HCL          |           1 \n",
       " agonyou         |           1 \n",
       " thomas_quinlan  |           1 \n",
       " jaynvora        |           1 \n",
       " MarioLifePool   |           1 \n",
       " serdaroncode    |           1 \n",
       " Get_it_Now_Sale |           1 \n",
       " Woody_MS_Bloke  |           1 \n",
       " NeuvooWatford   |           1 \n",
       " mpisching       |           1 \n",
       " AlessandroNegro |           1 \n",
       " Samhanknr       |           1 \n",
       " NenadBozicNs    |           1 \n",
       " SmartCat_io     |           1 \n",
       " b4d_tR1p        |           1 \n",
       " albertspijkers  |           1 \n",
       " Datalaker       |           1 \n",
       " triggsley       |           1 \n",
       " irregularbi     |           1 \n",
       " Klehmann79      |           1 \n",
       " 3rmarketf       |           1 \n",
       " Andrey_Lomakin  |           1 \n",
       " solyarisoftware |           1 \n",
       " SA_infra        |           1 \n",
       " 3rmarketfv      |           1 \n",
       " javioreto       |           1 \n",
       " Mario_Ezquerro  |           1 \n",
       " JohnnySoftware  |           1 \n",
       " kidehen         |           1 \n",
       " remialvado      |           1 \n",
       " TheMarketingU   |           1 \n",
       " GrowthBible     |           1 \n",
       " NtshFlors409    |           1 \n",
       " nimkar          |           1 \n",
       " jamesddube      |           1 \n",
       " HansB001        |           1 \n",
       " JamesJosephIgoe |           1 \n",
       " SylvainRoussy   |           1 \n",
       " NeuvooITSunnyv  |           1 \n",
       " NeuvooRouen     |           1 \n",
       " Nubexx          |           1 \n",
       " NirajMrunal     |           1 \n",
       " smqueue_live    |           1 \n",
       " harsha549       |           1 \n",
       " GruberHaig      |           1 \n",
       " VillagomezGetz  |           1 \n",
       " MendenhallParke |           1 \n",
       " LaytonBowles    |           1 \n",
       " AustinTamsyn1   |           1 \n",
       " OgdenRoselyn    |           1 \n",
       " FischerMaya     |           1 \n",
       " VamsiMeher      |           1 \n",
       " cloudboostio    |           1 \n",
       " LoopAILabs      |           1 \n",
       " patboshuizen    |           1 \n",
       " JLWoodward      |           1 \n",
       " javijunquera    |           1 \n",
       " mr_delkh        |           1 \n",
       " saeedurity      |           1 \n",
       " kphaser         |           1 \n",
       " smokin_wes      |           1 \n",
       " yodathekiller   |           1 "
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.run(\"\"\"\n",
    "    MATCH (user:User)-[:TWEETED]->(tweet:Tweet)\n",
    "    RETURN user.username AS username, COUNT(tweet) AS totalTweets\n",
    "    ORDER BY totalTweets DESC;\n",
    "\"\"\").to_table()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Ejercicio 5: Obten los 10 primeros tweets que ha generado el usuario con nombre de usuario 'couchbase'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>Tweet_Text</th></tr><tr><td style=\"text-align:left\">What looks like SQL but is easier than #MongoDB? Couchbase &amp;amp; N1QL. Agile development + scalable queries. Get started https://t.co/dfnLGknXJs</td></tr><tr><td style=\"text-align:left\">Want to quickly learn to build #NoSQL applications? Get FREE online training today: https://t.co/pPYZvZdqDi</td></tr><tr><td style=\"text-align:left\">The 3 mega-trends that define businesses leading the digital economy by #Couchbase CEO @bobwiederhold: https://t.co/pbLjou71nG #NoSQL</td></tr><tr><td style=\"text-align:left\">What looks like SQL but is easier than #MongoDB? Couchbase &amp;amp; N1QL. Agile development + scalable queries. Get started https://t.co/28Ni1HT2mx</td></tr><tr><td style=\"text-align:left\">Sign up in Oslo, Helsinki &amp;amp; Stockholm next month for FREE expert #bigdata training. Get developer agility w/ JSON https://t.co/4gjNQgZybL</td></tr><tr><td style=\"text-align:left\">$3.2 billion media giant undergoes massive changes &amp;amp; switches from #MongoDB to #Couchbase. https://t.co/gEiV2nVpm1</td></tr><tr><td style=\"text-align:left\">7 reasons why companies are switching from #MongoDB to #Couchbase: https://t.co/0b9yVl14bb #NoSQL #database</td></tr></table>"
      ],
      "text/plain": [
       " Tweet_Text                                                                                                                                       \n",
       "--------------------------------------------------------------------------------------------------------------------------------------------------\n",
       " What looks like SQL but is easier than #MongoDB? Couchbase &amp; N1QL. Agile development + scalable queries. Get started https://t.co/dfnLGknXJs \n",
       " Want to quickly learn to build #NoSQL applications? Get FREE online training today: https://t.co/pPYZvZdqDi                                      \n",
       " The 3 mega-trends that define businesses leading the digital economy by #Couchbase CEO @bobwiederhold: https://t.co/pbLjou71nG #NoSQL            \n",
       " What looks like SQL but is easier than #MongoDB? Couchbase &amp; N1QL. Agile development + scalable queries. Get started https://t.co/28Ni1HT2mx \n",
       " Sign up in Oslo, Helsinki &amp; Stockholm next month for FREE expert #bigdata training. Get developer agility w/ JSON https://t.co/4gjNQgZybL    \n",
       " $3.2 billion media giant undergoes massive changes &amp; switches from #MongoDB to #Couchbase. https://t.co/gEiV2nVpm1                           \n",
       " 7 reasons why companies are switching from #MongoDB to #Couchbase: https://t.co/0b9yVl14bb #NoSQL #database                                      "
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.run(\"\"\"\n",
    "    MATCH (user:User {username: 'couchbase'})-[:TWEETED]->(tweet:Tweet)\n",
    "    RETURN tweet.text AS Tweet_Text\n",
    "    LIMIT 10\n",
    "\"\"\").to_table()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Ejercicio 6: Obten los 10 hashtags que más aparecen en un tweet"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>hashtag.hashtag</th><th>hashtagCount</th></tr><tr><td style=\"text-align:left\">NoSQL</td><td style=\"text-align:right\">322</td></tr><tr><td style=\"text-align:left\">Java</td><td style=\"text-align:right\">176</td></tr><tr><td style=\"text-align:left\">BigData</td><td style=\"text-align:right\">173</td></tr><tr><td style=\"text-align:left\">Hadoop</td><td style=\"text-align:right\">151</td></tr><tr><td style=\"text-align:left\">SoapUi</td><td style=\"text-align:right\">127</td></tr><tr><td style=\"text-align:left\">Oracle</td><td style=\"text-align:right\">97</td></tr><tr><td style=\"text-align:left\">sqlserver</td><td style=\"text-align:right\">95</td></tr><tr><td style=\"text-align:left\">MongoDb</td><td style=\"text-align:right\">95</td></tr><tr><td style=\"text-align:left\">nosql</td><td style=\"text-align:right\">93</td></tr><tr><td style=\"text-align:left\">MongoDB</td><td style=\"text-align:right\">92</td></tr></table>"
      ],
      "text/plain": [
       " hashtag.hashtag | hashtagCount \n",
       "-----------------|--------------\n",
       " NoSQL           |          322 \n",
       " Java            |          176 \n",
       " BigData         |          173 \n",
       " Hadoop          |          151 \n",
       " SoapUi          |          127 \n",
       " Oracle          |           97 \n",
       " sqlserver       |           95 \n",
       " MongoDb         |           95 \n",
       " nosql           |           93 \n",
       " MongoDB         |           92 "
      ]
     },
     "execution_count": 46,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.run('''\n",
    "    MATCH (tweet:Tweet)-[:HASHTAG]->(hashtag:HashTag)\n",
    "    RETURN hashtag.hashtag, count(*) AS hashtagCount\n",
    "    ORDER BY hashtagCount DESC\n",
    "    LIMIT 10\n",
    "''').to_table()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Ejercicio 7: Obten los 10 hashtags que más aparecen junto al hashtag 'neo4j'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 52,
   "metadata": {},
   "outputs": [
    {
     "ename": "SyntaxError",
     "evalue": "invalid syntax (<ipython-input-52-c77a18a8d005>, line 1)",
     "output_type": "error",
     "traceback": [
      "\u001b[0;36m  File \u001b[0;32m\"<ipython-input-52-c77a18a8d005>\"\u001b[0;36m, line \u001b[0;32m1\u001b[0m\n\u001b[0;31m    MATCH (:HashTag {hashtag: 'neo4j'})<-[:HASHTAG]-(tweet:Tweet)-[:HASHTAG]->(otherHashtag:HashTag)\u001b[0m\n\u001b[0m           ^\u001b[0m\n\u001b[0;31mSyntaxError\u001b[0m\u001b[0;31m:\u001b[0m invalid syntax\n"
     ]
    }
   ],
   "source": [
    "MATCH (:HashTag {hashtag: 'neo4j'})<-[:HASHTAG]-(tweet:Tweet)-[:HASHTAG]->(otherHashtag:HashTag)\n",
    "RETURN otherHashtag.hashtag AS hashtag, COUNT(*) AS hashtagCount\n",
    "ORDER BY hashtagCount DESC\n",
    "LIMIT 10;\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "metadata": {},
   "outputs": [
    {
     "ename": "ClientError",
     "evalue": "[Statement.SyntaxError] Invalid input '{': expected an identifier (line 2, column 47 (offset: 51))\n\"    MATCH (hashtag:hashtag)-[:HASHTAG]->(hashtag: {hashtag: 'neo4j'})\"\n                                                   ^",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mClientError\u001b[0m                               Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-51-bb429b95c816>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m()\u001b[0m\n\u001b[1;32m      4\u001b[0m     \u001b[0mORDER\u001b[0m \u001b[0mBY\u001b[0m \u001b[0mhashtagCount\u001b[0m \u001b[0mDESC\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m      5\u001b[0m     \u001b[0mLIMIT\u001b[0m \u001b[0;36m10\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m----> 6\u001b[0;31m ''').to_table()\n\u001b[0m",
      "\u001b[0;32m/opt/conda/lib/python3.6/site-packages/py2neo/database.py\u001b[0m in \u001b[0;36mrun\u001b[0;34m(self, cypher, parameters, **kwparameters)\u001b[0m\n\u001b[1;32m    403\u001b[0m         \u001b[0;34m:\u001b[0m\u001b[0;32mreturn\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    404\u001b[0m         \"\"\"\n\u001b[0;32m--> 405\u001b[0;31m         \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mauto\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mrun\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mcypher\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mparameters\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0mkwparameters\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    406\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    407\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mevaluate\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mcypher\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mparameters\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0mkwparameters\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/opt/conda/lib/python3.6/site-packages/py2neo/database.py\u001b[0m in \u001b[0;36mrun\u001b[0;34m(self, cypher, parameters, **kwparameters)\u001b[0m\n\u001b[1;32m    989\u001b[0m                 result = self._connector.auto_run(cypher, parameters,\n\u001b[1;32m    990\u001b[0m                                                   \u001b[0mgraph_name\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mgraph\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mname\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 991\u001b[0;31m                                                   readonly=self.readonly)\n\u001b[0m\u001b[1;32m    992\u001b[0m             \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_connector\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mpull\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mresult\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m-\u001b[0m\u001b[0;36m1\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    993\u001b[0m             \u001b[0;32mreturn\u001b[0m \u001b[0mCursor\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mresult\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mhydrant\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/opt/conda/lib/python3.6/site-packages/py2neo/client/__init__.py\u001b[0m in \u001b[0;36mauto_run\u001b[0;34m(self, cypher, parameters, graph_name, readonly)\u001b[0m\n\u001b[1;32m   1338\u001b[0m         \u001b[0mcx\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_acquire\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mgraph_name\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1339\u001b[0m         \u001b[0;32mtry\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m-> 1340\u001b[0;31m             \u001b[0;32mreturn\u001b[0m \u001b[0mcx\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mauto_run\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mcypher\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mparameters\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mgraph_name\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mgraph_name\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mreadonly\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mreadonly\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m   1341\u001b[0m         \u001b[0;32mexcept\u001b[0m \u001b[0;34m(\u001b[0m\u001b[0mConnectionUnavailable\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mConnectionBroken\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1342\u001b[0m             \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mprune\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mcx\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mprofile\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/opt/conda/lib/python3.6/site-packages/py2neo/client/http.py\u001b[0m in \u001b[0;36mauto_run\u001b[0;34m(self, cypher, parameters, graph_name, readonly)\u001b[0m\n\u001b[1;32m    176\u001b[0m             \u001b[0mr\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_post\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mHTTPTransactionRef\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mautocommit_uri\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mgraph_name\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mcypher\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mparameters\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    177\u001b[0m             \u001b[0mrs\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mHTTPResponse\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mfrom_json\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mr\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mstatus\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mr\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mdata\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mdecode\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"utf-8\"\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 178\u001b[0;31m             \u001b[0mrs\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0maudit\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    179\u001b[0m             \u001b[0;32mreturn\u001b[0m \u001b[0mHTTPResult\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mHTTPTransactionRef\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mgraph_name\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mrs\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mresult\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mprofile\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mprofile\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    180\u001b[0m         \u001b[0;32mfinally\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/opt/conda/lib/python3.6/site-packages/py2neo/client/http.py\u001b[0m in \u001b[0;36maudit\u001b[0;34m(self, tx)\u001b[0m\n\u001b[1;32m    480\u001b[0m             \u001b[0;32mif\u001b[0m \u001b[0mtx\u001b[0m \u001b[0;32mis\u001b[0m \u001b[0;32mnot\u001b[0m \u001b[0;32mNone\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    481\u001b[0m                 \u001b[0mtx\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mmark_broken\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 482\u001b[0;31m             \u001b[0;32mraise\u001b[0m \u001b[0mfailure\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m",
      "\u001b[0;31mClientError\u001b[0m: [Statement.SyntaxError] Invalid input '{': expected an identifier (line 2, column 47 (offset: 51))\n\"    MATCH (hashtag:hashtag)-[:HASHTAG]->(hashtag: {hashtag: 'neo4j'})\"\n                                                   ^"
     ]
    }
   ],
   "source": [
    "graph.run('''\n",
    "    MATCH (tweet:Tweet)-[:HASHTAG]->(hashtag: {hashtag: 'neo4j'})\n",
    "    RETURN hashtag.hashtag, count(*) AS hashtagCount\n",
    "    ORDER BY hashtagCount DESC\n",
    "    LIMIT 10\n",
    "''').to_table()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "graphdb 5\n",
      "nosql 5\n",
      "socialNetworks 5\n"
     ]
    }
   ],
   "source": [
    "# Consulta:\n",
    "query = \"\"\"\n",
    "MATCH (targetHashtag:HashTag {hashtag: 'neo4j'})<-[:HASHTAG]-(tweet:Tweet)-[:HASHTAG]->(relatedHashtag:HashTag)\n",
    "RETURN relatedHashtag.hashtag AS hashtag, COUNT(tweet) AS count\n",
    "ORDER BY count DESC\n",
    "LIMIT 10;\n",
    "\"\"\"\n",
    "# Ejecutar consulta:\n",
    "result = graph.run(query)\n",
    "\n",
    "# Imprimir resultado:\n",
    "for record in result:\n",
    "    print(record[\"hashtag\"], record[\"count\"])"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Ejercicio 8: Obten los 10 usuarios con más seguidores"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Consulta:\n",
    "query = \"\"\"\n",
    "MATCH (user:User)\n",
    "WHERE user.followers_count IS NOT NULL\n",
    "RETURN user.username AS username, user.followers_count AS followersCount\n",
    "ORDER BY followersCount DESC\n",
    "LIMIT 10;\n",
    "\"\"\"\n",
    "\n",
    "# Ejecutar consulta:\n",
    "result = graph.run(query)\n",
    "\n",
    "# Imprimir resultado:\n",
    "for record in result:\n",
    "    print(record[\"username\"], record[\"followersCount\"])"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 1
}
