{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Lenguaje de consulta Cypher"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "\n",
    "<img src=\"../images/neo4j/Neo4j-logo.jpg\" alt=\"Neo4j Logo\" style=\"width: 400px; PADDING-LEFT: 5px\"/>\n",
    "\n",
    "## Introducción\n",
    "\n",
    "Cypher es un lenguaje de consulta de grafos declarativo que permite realizar consultas de datos expresivas y eficientes en un grafo de propiedades.\n",
    "\n",
    "En este notebook vamos a ver las principales operaciones que podemos realizar sobre Neo4j con este lenguaje de consulta."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Preparación del entorno\n",
    "\n",
    "Para trabajar con neo4j desde python vamos a utilizar la librería py2neo. Puedes encontrar la documentación en su página web: https://py2neo.org/v4/index.html"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Requirement already satisfied: pprintpp in /opt/conda/lib/python3.6/site-packages (0.4.0)\n",
      "Requirement already satisfied: py2neo in /opt/conda/lib/python3.6/site-packages (2021.2.3)\n",
      "Requirement already satisfied: certifi in /opt/conda/lib/python3.6/site-packages (from py2neo) (2018.8.24)\n",
      "Requirement already satisfied: packaging in /opt/conda/lib/python3.6/site-packages (from py2neo) (18.0)\n",
      "Requirement already satisfied: monotonic in /opt/conda/lib/python3.6/site-packages (from py2neo) (1.6)\n",
      "Requirement already satisfied: pygments>=2.0.0 in /opt/conda/lib/python3.6/site-packages (from py2neo) (2.2.0)\n",
      "Requirement already satisfied: six>=1.15.0 in /opt/conda/lib/python3.6/site-packages (from py2neo) (1.16.0)\n",
      "Requirement already satisfied: urllib3 in /opt/conda/lib/python3.6/site-packages (from py2neo) (1.23)\n",
      "Requirement already satisfied: interchange~=2021.0.4 in /opt/conda/lib/python3.6/site-packages (from py2neo) (2021.0.4)\n",
      "Requirement already satisfied: pansi>=2020.7.3 in /opt/conda/lib/python3.6/site-packages (from py2neo) (2020.7.3)\n",
      "Requirement already satisfied: pytz in /opt/conda/lib/python3.6/site-packages (from interchange~=2021.0.4->py2neo) (2018.5)\n",
      "Requirement already satisfied: pyparsing>=2.0.2 in /opt/conda/lib/python3.6/site-packages (from packaging->py2neo) (2.2.2)\n"
     ]
    }
   ],
   "source": [
    "# Como instalar py2neo\n",
    "!pip install pprintpp\n",
    "!pip install py2neo"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "from py2neo import Graph, Relationship, Node\n",
    "import json\n",
    "\n",
    "graph = Graph(\"http://neo4j:1234@neo4j:7474/db/data\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Borrado de todos los nodos y relaciones de la base de datos\n",
    "\n",
    "Para resetear el notebook tras ejecuciones anteriores, primero vamos a borrar todos los nodos y realaciones existentes en la base de datos."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "scrolled": true
   },
   "outputs": [],
   "source": [
    "graph.run(\"MATCH (n) DETACH DELETE n\").evaluate()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Insertar información \n",
    "\n",
    "Vamos la ver las sentencias de creacón:\n",
    "\n",
    "### Crear un nodo\n",
    "Para crear un nodo utilizamos la sentencia **CREATE**. Esta senencia nos permite crear el patrón que necesitemos:\n",
    "\n",
    "() - Nodo\n",
    "\n",
    "(matrix) - Variable\n",
    "\n",
    "(:Movie) - Etiqueta\n",
    "\n",
    "(matrix:Movie) - Variable + Etiqueta\n",
    "\n",
    "(matrix:Movie {title: \"The Matrix\"}) - Atributo\n",
    "\n",
    "(matrix:Movie {title: \"The Matrix\", released: 1997})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph.run(\"\"\"\n",
    "    CREATE (:Movie { title:\"The Matrix\",released:1997 })\n",
    "\"\"\").evaluate()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Si además de crear el nodo quermos ver el dato insertado utilizamos el comando **RETURN**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>p</th></tr><tr><td style=\"text-align:left\">(_1:Person {born: 1964, name: &#039;Keanu Reeves&#039;})</td></tr></table>"
      ],
      "text/plain": [
       " p                                              \n",
       "------------------------------------------------\n",
       " (_1:Person {born: 1964, name: 'Keanu Reeves'}) "
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.run(\"\"\"\n",
    "    CREATE (p:Person { name:\"Keanu Reeves\", born:1964 })\n",
    "    RETURN p\n",
    "\"\"\").to_table()               "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Crear relaciones\n",
    "\n",
    "Para crear relaciones utilizaremos las sentencia CREATE con el patrón deseado:\n",
    "\n",
    "--> o <--\n",
    "\n",
    "-[role]->\n",
    "\n",
    "-[:ACTED_IN]->\n",
    "\n",
    "-[role:ACTED_IN]->\n",
    "\n",
    "-[role:ACTED_IN {roles: [\"Neo\"]}]->\n",
    "\n",
    "Podemos crear mas de un elemento separandolos por comas o utilizando varias sentencias create simultaneamente.\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>a</th><th>d</th><th>r</th><th>m</th><th>dr</th></tr><tr><td style=\"text-align:left\">(_2:Person {born: 1956, name: &#039;Tom Hanks&#039;})</td><td style=\"text-align:left\">(_4:Person {born: 1951, name: &#039;Robert Zemeckis&#039;})</td><td style=\"text-align:left\">(Tom Hanks)-[:ACTED_IN {roles: [&#039;Forrest&#039;]}]-&gt;(_3)</td><td style=\"text-align:left\">(_3:Movie {released: 1994, title: &#039;Forrest Gump&#039;})</td><td style=\"text-align:left\">(Robert Zemeckis)-[:DIRECTED {}]-&gt;(_3)</td></tr></table>"
      ],
      "text/plain": [
       " a                                           | d                                                 | r                                                  | m                                                  | dr                                     \n",
       "---------------------------------------------|---------------------------------------------------|----------------------------------------------------|----------------------------------------------------|----------------------------------------\n",
       " (_2:Person {born: 1956, name: 'Tom Hanks'}) | (_4:Person {born: 1951, name: 'Robert Zemeckis'}) | (Tom Hanks)-[:ACTED_IN {roles: ['Forrest']}]->(_3) | (_3:Movie {released: 1994, title: 'Forrest Gump'}) | (Robert Zemeckis)-[:DIRECTED {}]->(_3) "
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.run(\"\"\"\n",
    "    CREATE (a:Person { name:\"Tom Hanks\",\n",
    "      born:1956 })-[r:ACTED_IN { roles: [\"Forrest\"]}]->(m:Movie { title:\"Forrest Gump\",released:1994 })\n",
    "    CREATE (d:Person { name:\"Robert Zemeckis\", born:1951 })-[dr:DIRECTED]->(m)\n",
    "    RETURN a,d,r,m,dr\n",
    "\"\"\").to_table() "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "El resultado de la sentencia anterior es el siguiente grafo:\n",
    "\n",
    "<img src=\"../images/neo4j/cypher1.png\" alt=\"Initial Graph\"/>"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Consulta de datos\n",
    "\n",
    "Para realizar consultas utilizaremos la sentencia MATCH, que permite indicar el patrón que quermos buscar sobre la base de datos.\n",
    "\n",
    "### Podemos consultar los nodos con una etiquea determinada"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>m</th></tr><tr><td style=\"text-align:left\">(_0:Movie {released: 1997, title: &#039;The Matrix&#039;})</td></tr><tr><td style=\"text-align:left\">(_3:Movie {released: 1994, title: &#039;Forrest Gump&#039;})</td></tr></table>"
      ],
      "text/plain": [
       " m                                                  \n",
       "----------------------------------------------------\n",
       " (_0:Movie {released: 1997, title: 'The Matrix'})   \n",
       " (_3:Movie {released: 1994, title: 'Forrest Gump'}) "
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.run(\"\"\"\n",
    "    MATCH (m:Movie)\n",
    "    RETURN m\n",
    "\"\"\").to_table() "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Podemos buscar un nodo con una etiqueta determinada y con una propiedad concreta\n",
    "\n",
    "Vamos a buscar la Persona que se llama Keanu Reeves\n",
    "\n",
    "Como vemos no es necesario informar todas la propiedades para  buscar un nodo."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>p</th></tr><tr><td style=\"text-align:left\">(_1:Person {born: 1964, name: &#039;Keanu Reeves&#039;})</td></tr></table>"
      ],
      "text/plain": [
       " p                                              \n",
       "------------------------------------------------\n",
       " (_1:Person {born: 1964, name: 'Keanu Reeves'}) "
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.run(\"\"\"\n",
    "    MATCH (p:Person { name:\"Keanu Reeves\" })\n",
    "    RETURN p\n",
    "\"\"\").to_table() "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Si añadimos relacciones al patrón podemos obtener resultados más completos\n",
    "\n",
    "Queremos saber en que películas ha actuado Tom Hanks y que papel ha interpretado en ellas"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>m.title</th><th>r.roles</th></tr><tr><td style=\"text-align:left\">Forrest Gump</td><td style=\"text-align:left\">[&#039;Forrest&#039;]</td></tr></table>"
      ],
      "text/plain": [
       " m.title      | r.roles     \n",
       "--------------|-------------\n",
       " Forrest Gump | ['Forrest'] "
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.run(\"\"\"\n",
    "    MATCH (p:Person { name:\"Tom Hanks\" })-[r:ACTED_IN]->(m:Movie)\n",
    "    RETURN m.title, r.role\n",
    "\"\"\").to_table() "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Incrementar el grafo\n",
    "\n",
    "Si queremos añadir nuevos nodos y relacionarlos con los nodos ya existentes, primero es necesario buscar los nodos que ya existen a los que queremos añadir nuevas relaciones. \n",
    "\n",
    "Vamos a añadir la película \"cloud Atlas\" y relacionarla con el nodo \"Tom Hanks\" para indicar que ha actuado en ella."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>p</th><th>r</th><th>m</th></tr><tr><td style=\"text-align:left\">(_2:Person {born: 1956, name: &#039;Tom Hanks&#039;})</td><td style=\"text-align:left\">(Tom Hanks)-[:ACTED_IN {roles: [&#039;Zachry&#039;]}]-&gt;(_5)</td><td style=\"text-align:left\">(_5:Movie {released: 2012, title: &#039;Cloud Atlas&#039;})</td></tr></table>"
      ],
      "text/plain": [
       " p                                           | r                                                 | m                                                 \n",
       "---------------------------------------------|---------------------------------------------------|---------------------------------------------------\n",
       " (_2:Person {born: 1956, name: 'Tom Hanks'}) | (Tom Hanks)-[:ACTED_IN {roles: ['Zachry']}]->(_5) | (_5:Movie {released: 2012, title: 'Cloud Atlas'}) "
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.run(\"\"\"\n",
    "    MATCH (p:Person { name:\"Tom Hanks\" })\n",
    "    CREATE (m:Movie { title:\"Cloud Atlas\",released:2012 })\n",
    "    CREATE (p)-[r:ACTED_IN { roles: ['Zachry']}]->(m)\n",
    "    RETURN p,r,m\n",
    "\"\"\").to_table() "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Completar Patrones\n",
    "\n",
    "Otra forma de añadir información al grafo "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>m</th></tr><tr><td style=\"text-align:left\">(_5:Movie {released: 2012, title: &#039;Cloud Atlas&#039;})</td></tr></table>"
      ],
      "text/plain": [
       " m                                                 \n",
       "---------------------------------------------------\n",
       " (_5:Movie {released: 2012, title: 'Cloud Atlas'}) "
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.run(\"\"\"\n",
    "    MERGE (m:Movie { title:\"Cloud Atlas\" })\n",
    "    ON CREATE SET m.released = 2012\n",
    "    RETURN m\n",
    "\"\"\").to_table() "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>p</th><th>r</th><th>m</th></tr><tr><td style=\"text-align:left\">(_2:Person {born: 1956, name: &#039;Tom Hanks&#039;})</td><td style=\"text-align:left\">(Tom Hanks)-[:ACTED_IN {roles: [&#039;Zachry&#039;]}]-&gt;(_5)</td><td style=\"text-align:left\">(_5:Movie {released: 2012, title: &#039;Cloud Atlas&#039;})</td></tr></table>"
      ],
      "text/plain": [
       " p                                           | r                                                 | m                                                 \n",
       "---------------------------------------------|---------------------------------------------------|---------------------------------------------------\n",
       " (_2:Person {born: 1956, name: 'Tom Hanks'}) | (Tom Hanks)-[:ACTED_IN {roles: ['Zachry']}]->(_5) | (_5:Movie {released: 2012, title: 'Cloud Atlas'}) "
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.run(\"\"\"\n",
    "    MATCH (m:Movie { title:\"Cloud Atlas\" })\n",
    "    MATCH (p:Person { name:\"Tom Hanks\" })\n",
    "    MERGE (p)-[r:ACTED_IN]->(m)\n",
    "    ON CREATE SET r.roles =['Zachry']\n",
    "    RETURN p,r,m\n",
    "\"\"\").to_table() "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>y</th><th>m10</th><th>m11</th></tr><tr><td style=\"text-align:left\">(_9:Year {year: 2014})</td><td style=\"text-align:left\">(_10:Month {month: 10})</td><td style=\"text-align:left\">(_11:Month {month: 11})</td></tr></table>"
      ],
      "text/plain": [
       " y                      | m10                     | m11                     \n",
       "------------------------|-------------------------|-------------------------\n",
       " (_9:Year {year: 2014}) | (_10:Month {month: 10}) | (_11:Month {month: 11}) "
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.run(\"\"\"\n",
    "    CREATE (y:Year { year:2014 })\n",
    "    MERGE (y)<-[:IN_YEAR]-(m10:Month { month:10 })\n",
    "    MERGE (y)<-[:IN_YEAR]-(m11:Month { month:11 })\n",
    "    RETURN y,m10,m11\n",
    "\"\"\").to_table() "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Modificar un nodo"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table></table>"
      ],
      "text/plain": []
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.run(\"\"\"\n",
    "    MATCH (n:Person {name : \"Keanu Reeves\"})\n",
    "    SET n.hair = \"Brown\"\n",
    "\"\"\").evaluate()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>n</th></tr><tr><td style=\"text-align:left\">(_1:Person {born: 1964, hair: &#039;Brown&#039;, name: &#039;Keanu Reeves&#039;})</td></tr><tr><td style=\"text-align:left\">(_2:Person {born: 1956, name: &#039;Tom Hanks&#039;})</td></tr><tr><td style=\"text-align:left\">(_4:Person {born: 1951, name: &#039;Robert Zemeckis&#039;})</td></tr></table>"
      ],
      "text/plain": [
       " n                                                             \n",
       "---------------------------------------------------------------\n",
       " (_1:Person {born: 1964, hair: 'Brown', name: 'Keanu Reeves'}) \n",
       " (_2:Person {born: 1956, name: 'Tom Hanks'})                   \n",
       " (_4:Person {born: 1951, name: 'Robert Zemeckis'})             "
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.run(\"\"\"\n",
    "    MATCH (n:Person)\n",
    "    RETURN n\n",
    "\"\"\").to_table()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Borrar un nodo"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>n</th></tr><tr><td style=\"text-align:left\">(_13:Person {name: &#039;Alex&#039;})</td></tr></table>"
      ],
      "text/plain": [
       " n                           \n",
       "-----------------------------\n",
       " (_13:Person {name: 'Alex'}) "
      ]
     },
     "execution_count": 32,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.run(\"\"\"\n",
    "    CREATE (n:Person {name : \"Alex\"})\n",
    "    RETURN n;\n",
    "\"\"\").to_table() "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph.run(\"\"\"\n",
    "    MATCH (Alex:Person {name:\"Alex\"})\n",
    "    DELETE Alex\n",
    "\"\"\").evaluate() "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
