{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# PRÁCTICA NOSQL - SHAKESPEARE - PLACES_2\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "PRUEBA 2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Requirement already satisfied: pprintpp in /opt/conda/lib/python3.6/site-packages (0.4.0)\n",
      "Requirement already satisfied: py2neo in /opt/conda/lib/python3.6/site-packages (2021.2.3)\n",
      "Requirement already satisfied: pygments>=2.0.0 in /opt/conda/lib/python3.6/site-packages (from py2neo) (2.2.0)\n",
      "Requirement already satisfied: interchange~=2021.0.4 in /opt/conda/lib/python3.6/site-packages (from py2neo) (2021.0.4)\n",
      "Requirement already satisfied: six>=1.15.0 in /opt/conda/lib/python3.6/site-packages (from py2neo) (1.16.0)\n",
      "Requirement already satisfied: pansi>=2020.7.3 in /opt/conda/lib/python3.6/site-packages (from py2neo) (2020.7.3)\n",
      "Requirement already satisfied: monotonic in /opt/conda/lib/python3.6/site-packages (from py2neo) (1.6)\n",
      "Requirement already satisfied: packaging in /opt/conda/lib/python3.6/site-packages (from py2neo) (18.0)\n",
      "Requirement already satisfied: urllib3 in /opt/conda/lib/python3.6/site-packages (from py2neo) (1.23)\n",
      "Requirement already satisfied: certifi in /opt/conda/lib/python3.6/site-packages (from py2neo) (2018.8.24)\n",
      "Requirement already satisfied: pytz in /opt/conda/lib/python3.6/site-packages (from interchange~=2021.0.4->py2neo) (2018.5)\n",
      "Requirement already satisfied: pyparsing>=2.0.2 in /opt/conda/lib/python3.6/site-packages (from packaging->py2neo) (2.2.2)\n"
     ]
    }
   ],
   "source": [
    "# Instalar librerías pprintpp y py2neo\n",
    "# pprintpp -  (pretty-print) mejora la legibilidad al mostrar estructuras de datos complejas.\n",
    "# py2neo - facilita la creación y ejecución de consultas en Neo4j usando Python\n",
    "\n",
    "!pip install pprintpp\n",
    "!pip install py2neo"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Importación de clases de py2neo:\n",
    "    # Graph, para representar la conexión con la base de datos.\n",
    "    # Relationship, para modelar relaciones entre nodos en la base de datos.\n",
    "    # Node, para representar nodos en la base de datos.\n",
    "\n",
    "from py2neo import Graph, Relationship, Node\n",
    "\n",
    "graph = Graph(\"http://neo4j:1234@neo4j:7474/db/data\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Resetear notebook tras ejecuciones anteriores borrando los nodos y realaciones existentes en la base de datos.\n",
    "\n",
    "graph.run(\"MATCH (n) DETACH DELETE n\").evaluate()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>id</th><th>name</th><th>state</th><th>populationPercent</th><th>uniqueness</th><th>type</th><th>entityType</th><th>labelsOrTypes</th><th>properties</th><th>provider</th></tr><tr><td style=\"text-align:right\">3</td><td style=\"text-align:left\">constraint_13f3da85</td><td style=\"text-align:left\">ONLINE</td><td style=\"text-align:right\">100.0</td><td style=\"text-align:left\">UNIQUE</td><td style=\"text-align:left\">BTREE</td><td style=\"text-align:left\">NODE</td><td style=\"text-align:left\">[&#039;Location&#039;]</td><td style=\"text-align:left\">[&#039;name&#039;]</td><td style=\"text-align:left\">native-btree-1.0</td></tr><tr><td style=\"text-align:right\">6</td><td style=\"text-align:left\">constraint_15c9d1c1</td><td style=\"text-align:left\">ONLINE</td><td style=\"text-align:right\">100.0</td><td style=\"text-align:left\">UNIQUE</td><td style=\"text-align:left\">BTREE</td><td style=\"text-align:left\">NODE</td><td style=\"text-align:left\">[&#039;Play&#039;]</td><td style=\"text-align:left\">[&#039;name&#039;]</td><td style=\"text-align:left\">native-btree-1.0</td></tr><tr><td style=\"text-align:right\">14</td><td style=\"text-align:left\">constraint_82051fbd</td><td style=\"text-align:left\">ONLINE</td><td style=\"text-align:right\">100.0</td><td style=\"text-align:left\">UNIQUE</td><td style=\"text-align:left\">BTREE</td><td style=\"text-align:left\">NODE</td><td style=\"text-align:left\">[&#039;City&#039;]</td><td style=\"text-align:left\">[&#039;name&#039;]</td><td style=\"text-align:left\">native-btree-1.0</td></tr><tr><td style=\"text-align:right\">1</td><td style=\"text-align:left\">index_343aff4e</td><td style=\"text-align:left\">ONLINE</td><td style=\"text-align:right\">100.0</td><td style=\"text-align:left\">NONUNIQUE</td><td style=\"text-align:left\">LOOKUP</td><td style=\"text-align:left\">NODE</td><td style=\"text-align:left\">[]</td><td style=\"text-align:left\">[]</td><td style=\"text-align:left\">token-lookup-1.0</td></tr><tr><td style=\"text-align:right\">2</td><td style=\"text-align:left\">index_f7700477</td><td style=\"text-align:left\">ONLINE</td><td style=\"text-align:right\">100.0</td><td style=\"text-align:left\">NONUNIQUE</td><td style=\"text-align:left\">LOOKUP</td><td style=\"text-align:left\">RELATIONSHIP</td><td style=\"text-align:left\">[]</td><td style=\"text-align:left\">[]</td><td style=\"text-align:left\">token-lookup-1.0</td></tr></table>"
      ],
      "text/plain": [
       " id | name                | state  | populationPercent | uniqueness | type   | entityType   | labelsOrTypes | properties | provider         \n",
       "----|---------------------|--------|-------------------|------------|--------|--------------|---------------|------------|------------------\n",
       "  3 | constraint_13f3da85 | ONLINE |             100.0 | UNIQUE     | BTREE  | NODE         | ['Location']  | ['name']   | native-btree-1.0 \n",
       "  6 | constraint_15c9d1c1 | ONLINE |             100.0 | UNIQUE     | BTREE  | NODE         | ['Play']      | ['name']   | native-btree-1.0 \n",
       " 14 | constraint_82051fbd | ONLINE |             100.0 | UNIQUE     | BTREE  | NODE         | ['City']      | ['name']   | native-btree-1.0 \n",
       "  1 | index_343aff4e      | ONLINE |             100.0 | NONUNIQUE  | LOOKUP | NODE         | []            | []         | token-lookup-1.0 \n",
       "  2 | index_f7700477      | ONLINE |             100.0 | NONUNIQUE  | LOOKUP | RELATIONSHIP | []            | []         | token-lookup-1.0 "
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Comprobar ÍNDICES Y CONSTRAINTS creados:\n",
    "graph.run(\"\"\"\n",
    "CALL db.indexes()\n",
    "\"\"\").to_table()\n",
    "\n",
    "#otra opción: graph.run(\"CALL db.indexes YIELD *\").to_table()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Datos descargados exitosamente.\n",
      "Índices y restricciones de unicidad creados exitosamente.\n",
      "Grafo creado exitosamente.\n",
      "\n",
      "Primeros 5 documentos JSON:\n",
      "\n",
      "Documento 1:\n",
      "{\n",
      "  \"type\": \"act\",\n",
      "  \"line_id\": 1,\n",
      "  \"play_name\": \"Henry IV\",\n",
      "  \"speech_number\": \"\",\n",
      "  \"line_number\": \"\",\n",
      "  \"speaker\": \"\",\n",
      "  \"text_entry\": \"ACT I\"\n",
      "}\n",
      "\n",
      "Documento 2:\n",
      "{\n",
      "  \"type\": \"scene\",\n",
      "  \"line_id\": 2,\n",
      "  \"play_name\": \"Henry IV\",\n",
      "  \"speech_number\": \"\",\n",
      "  \"line_number\": \"\",\n",
      "  \"speaker\": \"\",\n",
      "  \"text_entry\": \"SCENE I. London. The palace.\"\n",
      "}\n",
      "\n",
      "Documento 3:\n",
      "{\n",
      "  \"type\": \"line\",\n",
      "  \"line_id\": 3,\n",
      "  \"play_name\": \"Henry IV\",\n",
      "  \"speech_number\": \"\",\n",
      "  \"line_number\": \"\",\n",
      "  \"speaker\": \"\",\n",
      "  \"text_entry\": \"Enter KING HENRY, LORD JOHN OF LANCASTER, the EARL of WESTMORELAND, SIR WALTER BLUNT, and others\"\n",
      "}\n",
      "\n",
      "Documento 4:\n",
      "{\n",
      "  \"type\": \"line\",\n",
      "  \"line_id\": 4,\n",
      "  \"play_name\": \"Henry IV\",\n",
      "  \"speech_number\": 1,\n",
      "  \"line_number\": \"1.1.1\",\n",
      "  \"speaker\": \"KING HENRY IV\",\n",
      "  \"text_entry\": \"So shaken as we are, so wan with care,\"\n",
      "}\n",
      "\n",
      "Documento 5:\n",
      "{\n",
      "  \"type\": \"line\",\n",
      "  \"line_id\": 5,\n",
      "  \"play_name\": \"Henry IV\",\n",
      "  \"speech_number\": 1,\n",
      "  \"line_number\": \"1.1.2\",\n",
      "  \"speaker\": \"KING HENRY IV\",\n",
      "  \"text_entry\": \"Find we a time for frighted peace to pant,\"\n",
      "}\n"
     ]
    }
   ],
   "source": [
    "import json\n",
    "import requests\n",
    "from py2neo import Graph, Node, Relationship\n",
    "\n",
    "# URL del conjunto de datos\n",
    "url = \"https://raw.githubusercontent.com/rafaelgarrote/datahack-nosql/nosql-especial/workespecial/practica/data/shakespeare.json\"\n",
    "\n",
    "# Ruta del archivo local\n",
    "local_file = \"db_shakespeare.json\"\n",
    "\n",
    "# Realizar la solicitud HTTP\n",
    "response = requests.get(url)\n",
    "\n",
    "# Verificar si la solicitud fue exitosa (código de estado 200)\n",
    "if response.status_code == 200:\n",
    "    # Guardar los datos en un archivo local en modo \"escritura\"\n",
    "    with open(local_file, \"w\") as file:\n",
    "        file.write(response.text)\n",
    "    \n",
    "    print(\"Datos descargados exitosamente.\")\n",
    "\n",
    "    # Dividir las líneas y cargar cada línea como un objeto JSON\n",
    "    data_list = [json.loads(line) for line in response.text.split('\\n') if line]\n",
    "\n",
    "    # Verificar si los índices ya existen antes de intentar crearlos\n",
    "    if not graph.schema.get_indexes(\"City\"):\n",
    "        graph.run(\"CREATE INDEX ON :City(name)\")\n",
    "\n",
    "    if not graph.schema.get_indexes(\"Location\"):\n",
    "        graph.run(\"CREATE INDEX ON :Location(name)\")\n",
    "\n",
    "    if not graph.schema.get_indexes(\"Play\"):\n",
    "        graph.run(\"CREATE INDEX ON :Play(name)\")\n",
    "        \n",
    "    # Agrega restricciones de unicidad si no existen\n",
    "    if not graph.schema.get_uniqueness_constraints(\"City\"):\n",
    "        graph.run(\"DROP INDEX ON :City(name)\")  # Elimina el índice existente\n",
    "        graph.run(\"CREATE CONSTRAINT ON (city:City) ASSERT city.name IS UNIQUE\")\n",
    "    if not graph.schema.get_uniqueness_constraints(\"Location\"):\n",
    "        graph.run(\"DROP INDEX ON :Location(name)\")  # Elimina el índice existente\n",
    "        graph.run(\"CREATE CONSTRAINT ON (location:Location) ASSERT location.name IS UNIQUE\")\n",
    "    if not graph.schema.get_uniqueness_constraints(\"Play\"):\n",
    "        graph.run(\"DROP INDEX ON :Play(name)\")  # Elimina el índice existente\n",
    "        graph.run(\"CREATE CONSTRAINT ON (play:Play) ASSERT play.name IS UNIQUE\")\n",
    "\n",
    "    print(\"Índices y restricciones de unicidad creados exitosamente.\")\n",
    "\n",
    "    # Crea el grafo con los datos proporcionados\n",
    "    for entry in data_list:\n",
    "        if entry[\"type\"] == \"scene\" and \". \" in entry[\"text_entry\"]:\n",
    "            # Verificar que hay al menos dos elementos después de la primera división\n",
    "            location_split = entry[\"text_entry\"].split(\". \")[1].split(\". \")\n",
    "            if len(location_split) >= 2:\n",
    "                city, location = location_split\n",
    "\n",
    "                city_node = Node(\"City\", name=city)\n",
    "                location_node = Node(\"Location\", name=location)\n",
    "                play_node = Node(\"Play\", name=entry[\"play_name\"])\n",
    "\n",
    "                graph.merge(city_node, \"City\", \"name\")\n",
    "                graph.merge(location_node, \"Location\", \"name\")\n",
    "                graph.merge(play_node, \"Play\", \"name\")\n",
    "\n",
    "                city_location_rel = Relationship(city_node, \"HAS_LOCATION\", location_node)\n",
    "                location_play_rel = Relationship(location_node, \"LOCATION_OF\", play_node)\n",
    "\n",
    "                graph.merge(city_location_rel)\n",
    "                graph.merge(location_play_rel)\n",
    "\n",
    "    print(\"Grafo creado exitosamente.\")\n",
    "    \n",
    "    # Imprimir los primeros 5 documentos JSON\n",
    "    print(\"\\nPrimeros 5 documentos JSON:\")\n",
    "    for i, entry in enumerate(data_list[:5], 1):\n",
    "        print(f\"\\nDocumento {i}:\\n{json.dumps(entry, indent=2)}\")\n",
    "\n",
    "else:\n",
    "    print(f\"Error al obtener datos. Código de estado: {response.status_code}\")\n",
    "    \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n"
     ]
    }
   ],
   "source": [
    "   # Consulta Cypher para mostrar los 10 primeros nodos\n",
    "result = graph.run(\"\"\"\n",
    "        MATCH (p:Play)-[:LOCATION_OF]->(l:Location)<-[:HAS_LOCATION]-(c:City)\n",
    "        RETURN p.name AS Play, l.name AS Location, c.name AS City\n",
    "        ORDER BY p.name, l.name, c.name\n",
    "        LIMIT 10\n",
    "    \"\"\").to_table()\n",
    "print(result)\n",
    "\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "result = graph.run(\"\"\"\n",
    "    MATCH (p:Play)-[:LOCATION_OF]->(l:Location)<-[:HAS_LOCATION]-(c:City)\n",
    "    RETURN p.name AS Play, l.name AS Location, c.name AS City\n",
    "    ORDER BY p.name, l.name, c.name\n",
    "    LIMIT 10\n",
    "\"\"\").to_table()\n",
    "\n",
    "print(result)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Consulta 1: Listado con los lugares usados por las obras de Shakespeare\n",
    "result = graph.run(\"\"\"\n",
    "    MATCH (city:City)-[:HAS_LOCATION]->(location:Location)<-[:LOCATION_OF]-(play:Play)\n",
    "    RETURN city.name AS ciudad, location.name AS lugar, play.name AS obra\n",
    "\"\"\")\n",
    "for record in result:\n",
    "    print(record)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Consulta 1: Listado con los lugares usados por las obras de Shakespeare\n",
    "\n",
    "graph.run(\"\"\"\n",
    "    MATCH (c:City)-[:HAS_LOCATION]->(l:Location)<-[:LOCATION_OF]-(p:Play)\n",
    "    RETURN c.name AS City, l.name AS Location, p.name AS Play\n",
    "\"\"\").to_table()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Consulta 2: Obras de Shakespeare en una ciudad específica (por ejemplo, Londres)\n",
    "result = graph.run(\"\"\"\n",
    "    MATCH (city:City {name: 'Londres'})-[:HAS_LOCATION]->(location:Location)<-[:LOCATION_OF]-(play:Play)\n",
    "    RETURN city.name AS ciudad, location.name AS lugar, play.name AS obra\n",
    "\"\"\")\n",
    "for record in result:\n",
    "    print(record)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Consulta 3: Información detallada al nombrar un lugar\n",
    "nombre_del_lugar = \"LONDON\"\n",
    "\n",
    "result = graph.run(\"\"\"\n",
    "    MATCH (location:Location {name: $nombre_del_lugar})<-[:LOCATION_OF]-(play:Play)<-[:APPEARS_IN]-(scene:Scene)<-[:APPEARS_IN]-(character:Character)\n",
    "    RETURN play.name AS obra, scene.name AS escena, character.name AS personaje, scene.text_entry AS texto\n",
    "\"\"\", nombre_del_lugar=nombre_del_lugar)\n",
    "\n",
    "for record in result:\n",
    "    print(record)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "result = graph.run(\"MATCH (c:City) RETURN c\")\n",
    "for record in result:\n",
    "    print(record)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph.run(\"\"\"\n",
    "    MATCH (p:Play)\n",
    "    RETURN p.name AS Play\n",
    "\"\"\").to_table()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph.run(\"\"\"\n",
    "    MATCH (p:Play)\n",
    "    RETURN p.name AS Play\n",
    "\"\"\").to_table()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph.run(\"\"\"\n",
    "    MATCH (p:Play)\n",
    "    RETURN p\n",
    "    LIMIT 5\n",
    "\"\"\").to_table()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph.run(\"\"\"\n",
    "    MATCH (c:City)-[:HAS_LOCATION]->(l:Location)<-[:LOCATION_OF]-(p:Play)\n",
    "    RETURN c.name AS City, l.name AS Location, p.name AS Play\n",
    "\"\"\").to_table()\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
